{"_id":{"$oid":"6663409a9468760491a57e31"},"id":2143,"name":"High Pull","description":"High pull down on cable on machine..","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/1187/cd16b706-b9d2-47a7-81cf-a27724017d89.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44a0"},"id":151,"name":"Shrugs, Dumbbells","description":"<p>Stand with straight body, the hands are hanging freely on the side and hold each a dumbbell. Lift from this position the shoulders as high as you can, but don't bend the arms during the movement. On the highest point, make a short pause of 1 or 2 seconds before returning slowly to the initial position.</p>\n<p>When training with a higher weight, make sure that you still do the whole movement!</p>","category":"Shoulders","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/151/Dumbbell-shrugs-1.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f63a"},"id":1194,"name":"BUS DRIVERS","description":"Sitting with a Weight Plate, used as wheel, in both hands; raised slightly below eye level","category":"Shoulders","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51d6"},"id":2252,"name":"Talons fesses","description":"Touch your heels to your buttocks, while remaining static or moving","category":"Cardio","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/1285/1ab8005d-41e4-4505-9a7d-5277d59bb3cd.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6cb"},"id":90,"name":"Triceps Extensions on Cable With Bar","description":"<p>Grab the bar, stand with your feet shoulder wide, keep your back straight and lean forward a little. Push the bar down, making sure the elbows don't move during the exercise. Without pause go back to the initial position.</p>","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/660/62655fae-3358-4e70-a55d-3e842fd7ee56.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a0664b8086b49e371"},"id":268,"name":"Bent High Pulls","description":"<p>Bend over slightly while holding two dumbbells.  Pull the dumbbells up to your chest, keeping your elbows as high as you can.</p>","category":"Shoulders","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be449e"},"id":804,"name":"Leg Extension","description":"The leg extension is a resistance weight training exercise that targets the quadriceps muscle in the legs. The exercise is done using a machine called the Leg Extension Machine. There are various manufacturers of these machines and each one is slightly different. Most gym and weight rooms will have the machine in their facility. The leg extension is an isolated exercise targeting one specific muscle group, the quadriceps. It should not be considered as a total leg workout, such as the squat or deadlift. The exercise consists of bending the leg at the knee and extending the legs, then lowering them back to the original position.","category":"Legs","equipment":[],"image":"https://wger.de/media/exercise-images/369/78c915d1-e46d-4d30-8124-65d68664c3ef.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbca6"},"id":258,"name":"Upper External Oblique","description":"<p>Exercise for upper external oblique muscles</p>","category":"Chest","equipment":["Pull-up bar"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e35"},"id":263,"name":"Roman Chair","description":"<p>Crunches on roman chair</p>","category":"Abs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6cf"},"id":2063,"name":"Alternate back lunges","description":"The posterior muscles of the buttocks, hamstrings, soleus and gastrocnemius are trained more","category":"Legs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0f5"},"id":405,"name":"Barbell Lunges Standing","description":"<p>Put barbell on the back of your shoulders. Stand upright, then take the first step forward. Step should bring you forward so that your supporting legs knee can touch the floor. Then stand back up and repeat with the other leg.</p>\n<p>Remember to keep good posture.</p>","category":"Legs","equipment":["Barbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ae15598fe32d0b02d"},"id":1283,"name":"one-handed kettlebell curls","description":"Standing with the kettlebell in one hand and bent at the elbow, start from a fully extended position until your hand reaches shoulder height. To perform the movement correctly, try not to push with your back or body.","category":"Arms","equipment":["Kettlebell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44a6"},"id":2142,"name":"One Arm Bent Row","description":"One arm bent over row on cable with a machine","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/1186/1987a039-cf35-437e-bbdc-40c53dd7d053.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f63e"},"id":167,"name":"Cable Woodchoppers","description":"<p>Set cable pulley slightly lower than chest height. Keep body facing forward with hips stable.  Grab the pulley handle, fully extend your arms and bring your arms forward and across your body. Hold for 1 second at the end of the movement and slowly return to starting position.</p>","category":"Abs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a2c71904f529304dd"},"id":192,"name":"Bench Press","description":"<p>Lay down on a bench, the bar should be directly above your eyes, the knees are somewhat angled and the feet are firmly on the floor. Concentrate, breath deeply and grab the bar more than shoulder wide. Bring it slowly down till it briefly touches your chest at the height of your nipples. Push the bar up.</p>\n<p>If you train with a high weight it is advisable to have a <em>spotter</em> that can help you up if you can't lift the weight on your own.</p>\n<p>With the width of the grip you can also control which part of the chest is trained more:</p>\n<ul>\n<li>wide grip: outer chest muscles</li>\n<li>narrow grip: inner chest muscles and triceps</li>\n</ul>","category":"Chest","equipment":["Barbell","Bench"],"image":"https://wger.de/media/exercise-images/192/Bench-press-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51da"},"id":1193,"name":"Reverse EZ Bar Cable Curls","description":"Standing in front of cable tower using a SZ Bar","category":"Arms","equipment":["SZ-Bar"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44a8"},"id":1643,"name":"Split squats left","description":"<p>Starting position:</p><p>Stand with your back straight. Take a large step forward with your left leg.</p><p>Steps:</p><ol><li>Bring your pelvis down until you almost touch the floor with your right knee.</li><li>Bring your pelvis back up.</li><li>Repeat.</li></ol>","category":"Legs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c58b"},"id":307,"name":"Bear Walk","description":"<p>-Rest your weight on your palms and the balls of your feet, not dissimilar to normal pushup position</p>\n<p>-Move by stepping with your R palm and L foot, then your L palm and R foot.  Basically, walk like a lumbering bear.</p>\n<p>-Move as fast as you can.  Measure your reps/sets in either distance (i.e. 40 yards) or time (i.e. 45 seconds)</p>\n<p>-Works your Pecs, Deltoids, Triceps, Traps, Lats, Abs and Lower Back, Hip Flexors, Quads, Glutes and Calves</p>","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a0664b8086b49e373"},"id":2053,"name":"Press de banca sentado","description":"Pon la máquina de press de pecho para que al sentarte los agarres estén alineados con la parte inferior del pecho. Asegúrate de que estás sentado con la espalda bien pegada al asiento. Agarra una manija con cada mano, saca el pecho hacia afuera, mantén la cabeza contra el reposacabezas.\n\nRespira profundamente y empuja lentamente las manijas hacia adelante hasta que tus brazos estén casi completamente extendidos. Haz una pausa justo antes del bloqueo, y luego regresa lentamente las manijas a la posición inicial. Haz una pausa justo antes de que las manijas se detengan completamente y realiza otra repetición.","category":"Chest","equipment":["Bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbca8"},"id":1826,"name":"Backward shoulder rotation","description":"<p>Starting position:</p><p>Sit or stand with your back straight.</p><p>Steps:</p><ol><li>Place your hands on your shoulders.</li><li>Repeatedly rotate both shoulder joints in a circular motion at a moderate pace.</li></ol>","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44aa"},"id":1731,"name":"4-count burpees","description":"<p>Starting position:</p><p>Stand straight, feet hip-width apart.</p><p>Steps:</p><ol><li>Squat low and support yourself on the floor with your hands between the knees and in front of your feet, your back straight.</li><li>Keeping your hands on the floor, jump your legs backward into high plank position.</li><li>Jump your feet forward to return to the squat position.</li><li>Repeat.</li></ol>","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6d1"},"id":1190,"name":"Incline Skull Crush","description":"Siting in a 45 Degree Angle, using DB to do Incline Skull Crush","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a295cf54535c4a659"},"id":88,"name":"Bench Press Narrow Grip","description":"<p>Lay down on a bench, the bar is directly over your eyes, the knees form a slight angle and the feet are firmly on the ground. Hold the bar with a narrow grip (around 20cm.). Lead the weight slowly down till the arms are parallel to the floor (elbow: right angle), press then the bar up. When bringing the bar down, don't let it down on your nipples as with the regular bench pressing, but somewhat lower.</p>","category":"Arms","equipment":["Barbell","Bench"],"image":"https://wger.de/media/exercise-images/88/Narrow-grip-bench-press-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e37"},"id":1814,"name":"Forward shoulder rotation","description":"<p>Starting position:</p><p>Sit or stand with your back straight.</p><p>Steps:</p><ol><li>Place your hands on your shoulders.</li><li>Repeatedly rotate both shoulder joints in a circular motion at a moderate pace.</li></ol>","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f640"},"id":2118,"name":"Curl Araña","description":"1). Comience colocando la barra en la parte del banco en la que normalmente se sentaría. Debe asegurarse de alinear la barra correctamente para que no se caiga y esté equilibrada.\n\n2). Muévase a la parte delantera del banco, la parte donde generalmente se encuentran los brazos, y colóquese para recostarse en un ángulo de 45 grados con el estómago y el torso presionados contra la parte delantera del banco.\n\n3). Los pies, y especialmente los dedos de los pies, deben estar bien colocados en el piso. Luego coloque los brazos superiores sobre la almohadilla que se encuentra en la parte interior del banco. La almohadilla superior debe estar ajustada en las axilas.\n\n4). Use sus brazos para agarrar la barra con las palmas hacia arriba, con un poco de ancho de hombro o un poco más cerca. Su agarre para este ejercicio será importante. Sosteniendo las manos juntas, apuntará a la cabeza externa del bíceps, mientras que cuanto más separadas estén las manos, apuntará a la cabeza interna. Puede experimentar haciendo un conjunto de rizos con un agarre más cercano y otro conjunto con un agarre más ancho para asegurarse de golpear ambas cabezas del bíceps.\n\n5). Poco a poco comience a levantar la barra hacia arriba y exhale. Asegúrese de mantener la posición contratada por un segundo y luego apriete los bíceps. Al hacer esto, desea mantener la parte superior de los brazos estacionaria y rizar el peso lo más alto posible.\n\n6). Vuelva a colocar la barra lentamente en la posición inicial y asegúrese de respirar.\n\n7). Haga una breve pausa antes de repetir la cantidad recomendada de repeticiones para su set.","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/1139/e2962bcc-2f65-4d7e-8ea5-594ee0999a7a.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0f7"},"id":212,"name":"Underhand Lat Pull Down","description":"<p>Grip the pull-down bar with your palms facing you and your hands closer than shoulder-width apart. Lean back slightly and keep your back straight. Pull the bar down towards your chest, pulling your shoulders back slightly at the end of the motion.</p>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bfaaf71d471ce3f4e"},"id":325,"name":"Side Plank","description":"<p>Works your obliques and helps stabilize your spine. Lie on your side and support your body between your forearm and knee to your feet.</p>","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51dc"},"id":2141,"name":"Triceps Pushdown","description":"Triceps pushdown on cable using lat bar.\n","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/1185/c5ca283d-8958-4fd8-9d59-a3f52a3ac66b.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409a0664b8086b49e375"},"id":265,"name":"Cable External Rotation","description":"<p>Steps:</p>\n<ol>\n<li>Start off placing an extension band around a post or in a secure position where it will not release and is at elbow level.</li>\n<li>Position yourself to the side of the band and with your hand that is opposite of the band, reach out and grab the handle.</li>\n<li>Bring the band to your chest keeping your elbow bent in a 90 degree angle then slowly rotate your arm in a backhand motion so that the band externally rotates out</li>\n<li>Continue out as far as possible so that you feel a stretch in your shoulders, hold for a count and then return back to the starting position.</li>\n<li>Repeat for as many reps and sets as desired.</li>\n</ol>","category":"Shoulders","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbcaa"},"id":758,"name":"Barbell Wrist Curl","description":"<p>Sitting on a bench, grab a barbell with your palms facing up and your hands shoulder-width apart. Rest your forearms on your thighs and allow your wrists to hang over your knees. Perform the movement by curling your palms and wrists towards your face.</p>\n<p>Pause for a moment in the top position, then slowly return the barbell to the starting position.</p>\n<p> </p>","category":"Arms","equipment":["Barbell","Bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ae15598fe32d0b02f"},"id":318,"name":"Turkish Get-Up","description":"<p>Starting on back, move to the standing position with dumbbell in one hand.  Switch hands between reps.</p>","category":"Abs","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e39"},"id":570,"name":"Sumo Squats","description":"<p>Stand with your feet wider than your shoulders, with your toes pointed out at a 45 degree angle and barbell on your shoulder.</p>\n<p>While keeping your back straight, descend slowly by bending at the knees and hips as if you are sitting down (squatting).</p>\n<p>Lower yourself until your quadriceps and hamstrings are parallel to the floor.</p>\n<p>Return to the starting position by pressing upwards and extending your legs while maintaining an equal distribution of weight on your forefoot and heel.</p>","category":"Legs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f638"},"id":386,"name":"Seated Triceps Press","description":"<p>Sit down on a back (better with back support). Take a dumbbell firmly with both hands and hold it with extended arms over your head. With your palms facing upward and holding the weight of the dumbbell, slowly lower the weight behind your head.</p>\n<p> </p>","category":"Arms","equipment":["Bench","Dumbbell"],"image":"https://wger.de/media/exercise-images/549/765a6343-d28d-4052-86c6-7ae1abdd4992.PNG","diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbca2"},"id":269,"name":"Run - Treadmill","description":"<p>Run on a treadmill</p>","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b738c9cbab2be44ac"},"id":2038,"name":"Dumbbell sumo deadlift","description":"Lower your dumbbell to the ground between your legs. Assume a wide stance and with a straight back squat down. With the dumbbell standing upright, grip it by the top of the ‘head’&nbsp;(picture 1).<b>&nbsp;</b>Keeping your chest up and core braced, push the floor away, driving back upwards to a standing position&nbsp;(picture 2). Repeat. If you can easily achieve 20-30 reps, use two dumbbells.","category":"Legs","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/1088/9f66b288-ce8f-4154-ba80-78fee267263c.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0f9"},"id":113,"name":"Dumbbell Lunges Walking","description":"<p>Take two dumbbells in your hands, stand straight, feet about shoulder wide. Take one long step so that the front knee is approximately forming a right angle. The back leg is streched, the knee is low but doesn't touch the ground. \"Complete\" the step by standing up and repeat the movement with the other leg.</p>","category":"Legs","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/113/Walking-lunges-4.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e2f"},"id":1803,"name":"Kettlebell deadlifts","description":"<p>Starting position:</p><p>Stand hip-width apart, with your kettlebell centered between your ankles. Your back should be straight, your head facing forward.</p><p>Steps:</p><ol><li>Hinge at the hips and slightly bend at the knees to put your hands on the kettlebell handles. Your back should be straight as you perform the movement.</li><li>Grab the kettlebell handles, with your hands pushing in opposite directions as if to pull the handle apart.</li><li>While contacting your abs and glutes, stand straight up.</li><li>Hinge at the hips again to bring the kettlebell back down, similarly to step 1.</li><li>Repeat from step 3.</li></ol><p>Tips:</p><ul><li>Be sure you're performing the movements correctly, as doing otherwise can lead to injury. For example, do not squat instead of hinging at the hips, do not round your back while reaching for the kettlebell, and do not lean back while standing up.</li></ul>","category":"Back","equipment":["Kettlebell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b0664b8086b49e377"},"id":1742,"name":"No push-up burpees","description":"<p>Starting position:</p><p>Stand straight, feet hip-width apart.</p><p>Steps:</p><ol><li>Squat low and support yourself on the floor with your hands between the knees and in front of your feet, your back straight.</li><li>Keeping your hands on the floor, jump your legs backward into high plank position.</li><li>Jump your feet forward to return to the squat position.</li><li>Jump up.</li><li>Repeat.</li></ol>","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ae15598fe32d0b029"},"id":2176,"name":"Romanian deadlift, single leg","description":"Also known as: &nbsp;RDL.\n\nSteps:\n<ol><li></li></ol>","category":"Legs","equipment":["Dumbbell","Kettlebell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a0664b8086b49e36f"},"id":1917,"name":"Neck half circles","description":"<p>Starting position:</p><p>Start sitting or standing. Lean your head against one of your shoulders, but don't push.</p><p>Steps:</p><p>In one slower fluid motion and with your head relaxed and not pushing in any direction:</p><ol><li>bring your head down toward your chest.</li><li>then lean back aganst your other shoulder.</li><li>then back toward the chest again.4.and finally toward the starting position.</li></ol><p>Keep repeating this.</p>","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bc4c2d954b333f646"},"id":408,"name":"Glute Bridge","description":"<p>Lie on you back with your hips and knees flexed, feet on the ground. From this position, raise your butt off of the ground to a height where your body makes a straight line from your knees to your shoulders. To make the exercise more intense, you can add weight by letting a barbell rest on your hips as you complete the motion, or you can put your feet on a slightly higher surface such as a step or a bench.</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0fb"},"id":1070,"name":"Side Bends on Machine","description":"","category":"Abs","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a0664b8086b49e36d"},"id":2159,"name":"Tibialis raises","description":"<ol><li>\nStand up straight</li><li>Lift the balls of your feet, resting on your heels.</li></ol>","category":"Calves","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f644"},"id":293,"name":"Stationary Bike","description":"<p>Ride a Stationary Bike with various tensions.</p>","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bf809052be8872e57"},"id":355,"name":"Overhead Squat","description":"<p>The barbell is held overhead in a wide-arm snatch grip; however, it is also possible to use a closer grip if balance allows.</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbcb0"},"id":1206,"name":"Suspended crossess","description":"Suspension exercise with trx for chest training","category":"Cardio","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/927/7b392101-9c47-4693-935e-a88b1887eec5.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409b9468760491a57e3f"},"id":1204,"name":"SMITH MACHINE SLIGHT INCLINE PRESS","description":"laying under smith machine, with slight incline","category":"Chest","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6d3"},"id":1073,"name":"Tricep Pushdown on Cable","description":"The cable rope push-down is a popular exercise targeting the triceps muscles. It's easy to learn and perform, making it a favorite for everyone from beginners to advanced lifters. It is usually performed for moderate to high reps, such as 8-12 reps or more per set, as part of an upper-body or arm-focused workout.","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/805/ba006cae-44ca-46a9-bb71-6f5d4fa130e9.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbca4"},"id":1063,"name":"Front Wood Chop","description":"","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b34fcc347e3c49df4"},"id":2178,"name":"Trazioni orizzontali","description":"Le trazioni orizzontali agiscono <b>principalmente sui muscoli della schiena</b>,\n mentre le trazioni lavorano maggiormente sui muscoli della parte \nsuperiore della schiena e delle braccia. Combinando questi due esercizi \nsi ottiene un allenamento più completo per i muscoli della schiena e \ndelle braccia.","category":"Back","equipment":["Pull-up bar"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b7f2f6172dc3459a6"},"id":274,"name":"Dumbbell Triceps Extension","description":"<p>Position one dumbbell over head with both hands under inner plate (heart shaped grip).</p>\n<p>With elbows over head, lower forearm behind upper arm by flexing elbows. Flex wrists at bottom to avoid hitting dumbbell on back of neck. Raise dumbbell over head by extending elbows while hyperextending wrists. Return and repeat.</p>","category":"Arms","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b9468760491a57e3d"},"id":650,"name":"Hindu Squats","description":"<p>Start with your feet shoulder width apart and arms slightly behind your back.</p>\n<p>As you descend towards the floor, raise your heels off the ground, while keeping your back as vertical  as possible. </p>\n<p>Upon attaining the bottom position, touch the hands to the heels.</p>\n<p>Then stand up ending with the heels on the ground, arms extended in front of the chest then rowing into the start position.</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a2c71904f529304df"},"id":2099,"name":"Jalón abierto supino","description":"Movimiento&nbsp; descendente\n•&nbsp; Tire&nbsp; de&nbsp; la&nbsp; barra&nbsp; hacia&nbsp; abajo&nbsp; para&nbsp; que&nbsp; pase&nbsp; cerca&nbsp; de&nbsp; su&nbsp; barbilla&nbsp; y&nbsp; toque&nbsp; la&nbsp; parte&nbsp; superior&nbsp;&nbsp;\nde&nbsp; su&nbsp; pecho.&nbsp;&nbsp;\n•&nbsp; Mantenga&nbsp; el&nbsp; resto&nbsp; de&nbsp; su&nbsp; cuerpo&nbsp; inmóvil.","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/1125/8b7bc0bd-edf1-42f3-82dd-f1278c6545b3.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c58d"},"id":2025,"name":"Hindu Pushups","description":"Exercise to strengthen the shoulders and pectorals. Its name is due to the fact that it begins in the Yoga position \"Dog Facing Down\", passing to \"Cobra\" but without resting the legs or torso on the ground to finally end with a normal flexion. The exercise can also be performed backwards (back to the starting position). As a variation, after doing the push-up, the hip can be raised to return to downward facing dog.","category":"Shoulders","equipment":[],"image":"https://wger.de/media/exercise-images/1080/c4bf7ba1-6058-4d14-928f-7187885d5d57.webp","diary":[],"__v":0}
{"_id":{"$oid":"6663409b738c9cbab2be44ae"},"id":2111,"name":"PRESS HORIZONTAL","description":"Para realizarlo, debes estirarte sobre un banco plano con los pies en el suelo para facilitar la estabilidad. Sitúa las manos en pronación o semi-pronación (como te sea más cómodo) y realiza el movimiento.","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/1133/e930c960-dd46-4ec3-8648-a54610d8a6ce.PNG","diary":[],"__v":0}
{"_id":{"$oid":"6663409b295cf54535c4a65b"},"id":2259,"name":"Piegamenti a una mano","description":"Piegamenti sulle braccia eseguito con una sola mano","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51de"},"id":1055,"name":"One Arm Triceps Extensions on Cable","description":"","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b0e6a7c78b1d55a82"},"id":2073,"name":"Push-Ups","description":"Push-ups are an exercise in which a person, keeping a prone position, with the hands palms down under the shoulders, the balls of the feet on the ground, and the back straight, pushes the body up and lets it down by an alternate straightening and bending of the arms.","category":"Chest","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/1110/d89c5b93-45df-444b-8735-89db82eec3f5.gif","diary":[],"__v":0}
{"_id":{"$oid":"6663409be15598fe32d0b031"},"id":103,"name":"Sitting Calf Raises","description":"<p>Sit on a bench for calf raises and check that the feet are half free and that you can completely stretch the calf muscles down. Pull your calves up, going as far (up) as you can. Make at the highest point a short pause of 1 or 2 seconds and go down.</p>","category":"Calves","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbcae"},"id":2172,"name":"Shoulder width three-point push-up","description":"Get into a push-up position with your shoulders directly above your hands and your feet hip-width apart. Draw your belly button in towards your spine and tighten your abdominal muscles. Lift your left foot about five centimetres off the floor. Point your toes straight down. Do not move your hips. Your body forms a straight line from your head to your heels throughout the exercise. Now bend your elbows, lower your chest to the floor and push yourself back up. Repeat the exercise on the other side.","category":"Arms","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bcdf5fa1bf631cb9d"},"id":154,"name":"Leg Curls (laying)","description":"<p>Lay on a bench and put your calves behind the leg holder (better if they are hold on around the lower calves). Hold a grip on the bars to make sure the body is firmly in place. Bend your legs bringing the weight up, go slowly back. During the exercise the body should not move, all work is done by the legs.</p>","category":"Legs","equipment":[],"image":"https://wger.de/media/exercise-images/154/lying-leg-curl-machine-large-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409bfaaf71d471ce3f50"},"id":328,"name":"Speed Deadlift","description":"<p>Deadlift with short (less than one 1min) rest between sets.</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b0664b8086b49e379"},"id":1286,"name":"Medicine ball booklet crunch","description":"Using a medicine ball as an overload will make the exercise heavier.","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44a2"},"id":361,"name":"Pike Push Ups","description":"<p>Push Up performed from a pike position (optional to have feet elevated).</p>","category":"Arms","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bc4c2d954b333f648"},"id":188,"name":"Lat Pull Down (Leaning Back)","description":"<p>Lean Back, Pull into chest</p>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6c9"},"id":2072,"name":"Cable Concentration Curl","description":"The concentration curl is a classic exercise for building the biceps one arm at a time. It can be performed bent over or kneeling, but is more often performed seated on a bench. It's great for emphasizing the biceps peak and is often used to finish a biceps workout","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/1109/00b0a0bf-c14a-4f13-bb14-62c09030a1aa.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e33"},"id":347,"name":"Deadhang","description":"<p>Deadhang performed on an edge either with or without added weight (adujst edge or weight to adjust difficulty)</p>","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bc4c2d954b333f64a"},"id":1239,"name":"Trazioni orizzontali al trx","description":"È l'esercizio propedeutico dei Pull Up. I muscoli che vengono coinvolti in questo esercizio di tirata sono il&nbsp;<b style=\"\">gran dorsale, deltoide e bicipiti</b>.","category":"Abs","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/959/53a5e008-bc31-4ee0-9463-69a858c2ec18.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409be15598fe32d0b035"},"id":397,"name":"Run","description":"<p>Running or jogging outside in a park, on the tracks,...</p>","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51d4"},"id":1544,"name":"Lunges","description":"<p>Starting position:</p><p>Stand with back straight.</p><p>Steps:</p><ol><li>Take a large step forward with your left leg.</li><li>Bring your pelvis down until you almost touch the floor with your right knee.</li><li>Bring your pelvis back up.</li><li>Return to the starting position by stepping back.</li><li>Repeat, switching legs each time.</li></ol>","category":"Legs","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/984/5c7ffe68-e7b2-47f3-a22a-f9cc28640432.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409be15598fe32d0b037"},"id":215,"name":"Straight-arm Pull Down (rope Attachment)","description":"<p>Use the rope attachment on a high pulley. Grasp the two ends of the rope with your arms straight out in front of you. Pull your hands down towards your hips, while keeping your arms straight, then raise them back up to the starting position.</p>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c58f"},"id":1952,"name":"Calf raises, right leg","description":"<ol><li>Stand on the floor or on the edge of a step to increase the range of movement.&nbsp;</li><li>Raise one foot.</li><li>Lift your heel until you're standing on your toes.</li><li><i>(variable) </i>Stay in this position for three seconds</li><li>Slowly lower your foot until you almost touch the ground with your heel - don't slam your foot!</li></ol>","category":"Calves","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b34fcc347e3c49df6"},"id":1293,"name":"Leg raises pull up bar","description":"with a firm grip with both hands on the bar, raise your outstretched legs, until you reach a 90° angle with your torso.","category":"Abs","equipment":["Pull-up bar"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b1c26c2538127b6d7"},"id":1187,"name":"Zone 2 Running","description":"Zone two Cardio for endurance, you should be able to speak while running","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b2c71904f529304e1"},"id":104,"name":"Calf Raises on Hackenschmitt Machine","description":"<p>Place yourself on the machine with your back firmly against the backrest, the feet are on the platform for calf raises. Check that the feet are half free and that you can completely stretch the calf muscles down.</p>\n<p>With straight knees pull up your weight as much as you can. Go with a fluid movement down till the calves are completely stretched. Repeat.</p>","category":"Calves","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51e2"},"id":344,"name":"Barbell Triceps Extension","description":"<p>Position barbell overhead with narrow overhand grip.</p>\n<p>Lower forearm behind upper arm with elbows remaining overhead. Extend forearm overhead. Lower and repeat.</p>","category":"Arms","equipment":["Barbell"],"image":"https://wger.de/media/exercise-images/50/69b519d8-4861-4bb1-b504-3887aa30e7d8.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409b295cf54535c4a65d"},"id":2183,"name":"Finger Pushup","description":"1. Hand Positioning:\n   - Start in a plank position with your hands directly beneath your shoulders.\n   - Spread your fingers wide apart, placing them firmly on the ground.\n\n2. Finger Placement:\n   - Gradually lift your palms off the ground, shifting the weight onto your fingers.\n   - Focus on distributing the load evenly across your fingertips and thumbs.\n\n3. Body Alignment:\n   - Maintain a straight line from head to heels to engage your core.\n   - Keep your body in a controlled and stable position throughout the exercise.\n\n4. Lowering Phase:\n   - Slowly bend your elbows, lowering your chest towards the ground.\n   - Ensure controlled movement, maintaining stability on your fingertips.\n\n5. Pushing Up:\n   - Press through your fingertips to straighten your arms, returning to the starting position.\n   - Emphasize the engagement of your fingers and thumbs throughout the push-up.","category":"Arms","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/1217/590e65db-de60-4727-b7eb-55f80af56043.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f63c"},"id":81,"name":"Biceps Curls With Dumbbell","description":"<p>Hold two barbells, the arms are streched, the hands are on your side, the palms face inwards. Bend the arms and bring the weight with a fast movement up. At the same time, rotate your arms by 90 degrees at the very beginning of the movement. At the highest point, rotate a little the weights further outwards. Without a pause, bring them down, slowly.</p>\n<p>Don't allow your body to swing during the exercise, all work is done by the biceps, which are the only mucles that should move (pay attention to the elbows).</p>","category":"Arms","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/81/Biceps-curl-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a738c9cbab2be44a4"},"id":270,"name":"Pause Bench","description":"<p>Lower the bar to your chest and pause (but do not rest) there for 2 seconds. Press back up. use the same weight you would on bench press, but perform only single reps. Total the number of reps you did in one set of bench press (if you did 3 sets of 8 do 8 sinlge pause bench reps.</p>","category":"Chest","equipment":["Barbell","Bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b1c26c2538127b6d9"},"id":125,"name":"Leg Raises, Lying","description":"<p>Lay down on a bench and hold onto the recliner with your hands to keep you stable. Hold your legs straight and lift them till they make an angle of about 45°. Make a short pause of 1 sec. and go slowly down to the initial position. To increase the intensity you can make a longer pause of 7 sec. every 5th time.</p>","category":"Abs","equipment":["Gym mat"],"image":"https://wger.de/media/exercise-images/125/Leg-raises-1.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0fd"},"id":303,"name":"Flutter Kicks","description":"<p>-Laying on the back, lift your straightened legs from the ground at a 45 degree angle. </p>\n<p>-As your Left foot travels downward and nearly touches the floor, your Right foot should seek to reach a 90 degree angle, or as close to one as possible.</p>\n<p>-Bring your R foot down until it nearly touches the floor, and bring your L foot upwards.  Maintain leg rigidity throughout the exercise.  Your head should stay off the ground, supported by tightened upper abdominals.</p>\n<p>-(L up R down, L down R up, x2)  ^v, v^, ^v, v^ = 1 rep</p>\n<p>-Primarily works the Rectus Abdominus, the hip flexors and the lower back. Secondarily works the Obliques.  Emphasis placed on the lower quadrant of the abs.</p>\n<p> </p>","category":"Abs","equipment":[],"diary":[],"__v":0,"image":"https://as1.ftcdn.net/v2/jpg/03/91/54/66/1000_F_391546638_baBoSBHGM4DoCHmsoQngmS0oIHdM4eeV.jpg"}
{"_id":{"$oid":"6663409a70617ad4aca4f0f3"},"id":2033,"name":"YWTs","description":"<b>Starting position:</b>\nLie down, preferably on a mat. Stretch your arms above your head in a \"Y\" position (arms pointing up diagonally at around 45 degrees). Your thumbs should be pointing up.\n\n<b>Steps:</b>\n<ol><li>With arms in the Y position, lift your chest slightly from the ground, creating a pull tension in your arms upward.</li><li>Hold this position for several seconds (15–30 is ideal).</li><li>Keeping your chest up, bend at your elbows to move from a Y position to a \"W\" position, with arms bent at the elbows and maintaining the upward tension.</li><li>Hold for around as long as with the Y position.</li><li>Still with your chest up, move to a \"T\" position, straightening your arms out to the side to be perpendicular to your body.</li><li>Hold for around as long as you held the W position.</li><li>Move from the T position to the W position, then from the W position to the Y position.</li><li>Repeat.</li></ol>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409ae15598fe32d0b02b"},"id":759,"name":"Barbell Reverse Wrist Curl","description":"<p>Sitting on a bench, grab a barbell with your palms facing down and your hands shoulder-width apart. Rest your forearms on your thighs and allow your wrists to hang over your knees.</p>\n<p>Curl your knuckles towards your face, lifting the barbell. Pause for a moment in the top position, then slowly return the barbell to the starting position.</p>","category":"Arms","equipment":["Barbell","Bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51d8"},"id":182,"name":"Perfect Push Up","description":"<p>Push up with perfect push up</p>","category":"Chest","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409af809052be8872e53"},"id":2088,"name":"Remo maquina agarre estrecho","description":"Remo en máquina con barra en agarre estrecho","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/1119/9b138ad2-5b80-42a8-bfff-93a960444ffe.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409bcdf5fa1bf631cb99"},"id":2181,"name":"Reverse Snow Angel","description":"Lay flat on your stomach with your arms extended in front of you on the ground as your legs are lying flat. Lift both your arms and move them to your side slowly. Then, move them back.","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409afaaf71d471ce3f4c"},"id":119,"name":"Shoulder Press, Barbell","description":"<p>Sit on a bench, the back rest should be almost vertical. Take a barbell with a shoulder wide grip and bring it up to chest height. Press the weight up, but don't stretch the arms completely. Go slowly down and repeat.</p>","category":"Shoulders","equipment":["Barbell"],"image":"https://wger.de/media/exercise-images/119/seated-barbell-shoulder-press-large-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409ac4c2d954b333f642"},"id":326,"name":"Full Sit Outs","description":"<p>(A) Get in high plank position on your hands and toes.(B) Shift your weight to your left hand as you turn your body to the right; bend your right leg behind you and extend your right arm up. Return to the center and repeat on the opposite side. Continue, alternating sides.<strong>Make it easier:</strong> Don’t raise your arm after you bend your leg behind you.<strong>Make it harder:</strong> Balance with your arm and leg extended for two counts.</p>","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c589"},"id":1919,"name":"Head tilts","description":"<p>Starting position:</p><p>Sit or stand with your back straight.</p><p>Steps:</p><ol><li>Tilt your head to one side and hold for a bit.2.Return your head to neutral position and hold for a bit.</li><li>Tilt your head to the other side and hold for a bit.</li><li>Return your head to neutral position yet again and hold for a bit.</li><li>Repeat.</li></ol>","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51e6"},"id":339,"name":"Shotgun Row","description":"<ol>\n<li>Attach a single handle to a low cable.</li>\n<li>After selecting the correct weight, stand a couple feet back with a wide-split stance. Your arm should be extended and your shoulder forward. This will be your starting position.</li>\n<li>Perform the movement by retracting the shoulder and flexing the elbow. As you pull, supinate the wrist, turning the palm upward as you go.</li>\n<li>After a brief pause, return to the starting position.</li>\n</ol>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b604e3a332a4bbcb4"},"id":854,"name":"Hip Thrust","description":"<p>The bar should go directly on your upper thigh, directly below your crotch. Your feet should be directly under your knees. Push your hips up so that you form a straight line from your knees to your shoulders. Use a pad for comfort.</p>","category":"Legs","equipment":["Barbell","Bench"],"image":"https://wger.de/media/exercise-images/294/a6d6d740-eb6c-4a0d-ac28-72ad03abf76a.gif","diary":[],"__v":0}
{"_id":{"$oid":"6663409b34fcc347e3c49df2"},"id":2166,"name":"scorpion kick","description":"Start in a plank position with hands under your shoulders and your body in a straight line.\n\nSlowly lift your legs by bending your knees, aiming to bring your feet over your back while raising your hips.\n\nEngage your core muscles for stability, trying to bring your feet towards your head.\n\nHold this position briefly before slowly and controlledly bringing your legs back to the starting position.\n\nRepeat the movement slowly and steadily for the desired number of repetitions, ensuring to maintain form and avoid injuries.","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b70617ad4aca4f105"},"id":423,"name":"Jogging","description":"<p>Get your shoes on, go outside and start running at a moderate pace.</p>","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b70617ad4aca4f103"},"id":2052,"name":"Seated Bench Press","description":"Poner la máquina de press de pecho para que al sentarte los agarres estén alineados con la parte inferior del pecho. Asegúrate de que estás sentado con la espalda bien pegada al asiento. Agarra una manija con cada mano, saca el pecho hacia afuera, mantén la cabeza contra el reposacabezas.\n\nRespira profundamente y empuja lentamente las manijas hacia adelante hasta que tus brazos estén casi completamente extendidos. Haz una pausa justo antes del bloqueo, y luego regresa lentamente las manijas a la posición inicial. Haz una pausa justo antes de que las manijas se detengan completamente y realiza otra repetición.","category":"Chest","equipment":["Bench"],"image":"https://wger.de/media/exercise-images/1094/998ff15d-37af-422f-9936-7d54ac8bdd41.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51ea"},"id":2246,"name":"Dumbbell Chest Press","description":"The dumbbell chest press is a pressing exercise similar to the barbell bench press, except that it is performed with dumbbells.","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/1278/7d169058-5f70-40c1-b4ba-3f444f823add.webp","diary":[],"__v":0}
{"_id":{"$oid":"6663409be15598fe32d0b033"},"id":2121,"name":"Curl femoral sentado","description":"Ajusta la palanca de la máquina para adaptarla a tu altura y siéntate en la máquina con la espalda contra la almohadilla de respaldo.\nColoca los tobillos sobre los cojines , los muslos debajo del cojinete de sujeción justo por encima de las rodillas y las manos en los agarres.Al inspirar realiza una flexión de las rodillas.\nMantener la espalda inmóvil en todo momento únicamente solo debe movilizarse&nbsp; los pies por la flexión de rodilla.\nMantén la posición contraída por un segundo.\nLentamente regresa a la posición inicial. Espirar al final del movimiento.","category":"Legs","equipment":[],"image":"https://wger.de/media/exercise-images/1142/2999fcfb-e691-4f4b-b3e5-5f44288cadf0.PNG","diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c591"},"id":127,"name":"Upright Row, SZ-bar","description":"<p>Stand straight, your feet are shoulder-width apart. Hold the SZ-bar with an overhand grip on your thighs, the arms are stretched. Lift the bar close to the body till your chin. The elbows point out so that at the highest point they form a V. Make here a short pause before going slowly down and repeating the movement.</p>","category":"Shoulders","equipment":["SZ-Bar"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a2c71904f529304d9"},"id":2194,"name":"Dumbbell upright-row","description":"Hold a dumbbell in each hand in front of your body. Keep your palms towards your body. Lift you hands straight up until your hands are under your chin, then lower them. Repeat the exercise.","category":"Arms","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/1229/1e6f611c-ed53-48f1-8fdd-3b92ae3579c3.webp","diary":[],"__v":0}
{"_id":{"$oid":"6663409a7f2f6172dc3459a2"},"id":1050,"name":"Diamond push ups","description":"","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a793ce569af09c587"},"id":1080,"name":"Incline Bench Reverse Fly - Hello","description":"The incline dumbbell reverse fly is an upper-body exercise targeting the posterior or rear deltoids, as well as the postural muscles of the upper back. Because it targets such small muscles, this exercise is usually performed with light weight for high reps, such as 10-15 reps per set or more.","category":"Back","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/828/abfc7700-fadf-4f2d-ac84-e045e590a2fe.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a34fcc347e3c49df0"},"id":289,"name":"Axe Hold","description":"<p>Grab dumbbells and extend arms to side and hold as long as you can</p>","category":"Arms","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b295cf54535c4a65f"},"id":2174,"name":"Skydiver with arms in T-position","description":"Lie on your stomach with your legs more than shoulder-width apart and your feet up. Your arms are stretched out to the side and form a T with your upper body, your palms are on the floor. Now raise your upper body, arms and legs as high as you can while keeping your body under tension. Turn your thumbs towards the ceiling and pull your shoulder blades together. While keeping your upper body and all limbs in the air, bring your legs together and then spread them again, keeping them constantly in the air. For the remaining repetitions, only move your legs open and closed.","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bf809052be8872e55"},"id":122,"name":"Fly With Cable","description":"","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/122/Incline-cable-flyes-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409b34fcc347e3c49df8"},"id":1847,"name":"Head turns","description":"<p>Starting position:</p><p>Sit or stand with your back straight and shoulders down.</p><p>Steps:</p><ol><li>Sit or stand up straight, shoulders dropped.</li><li>Turn your head to the side as far as possible. Stop when you hit a barrier and hold for 5 seconds.</li><li>Return to center position and repeat, changing sides.</li></ol>","category":"Shoulders","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b2c71904f529304e3"},"id":2078,"name":"3D lunge warmup","description":"As a warmup, use light dumbbells, one in each hand. Lunge in alternating directions, forward, sideways, backwards and 45 degree angles.","category":"Cardio","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51e8"},"id":2157,"name":"Adduktorenmaschine","description":"Hinsetzen, Beine in die Auflage legen/gegen die Polster drücken, Beine zusammendrücken bis die Auflagen aneinander stoßen","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a70617ad4aca4f0f1"},"id":165,"name":"Incline Plank With Alternate Floor Touch","description":"<p>Perform the plank with legs elevated, feet on a gymball. Once stabilised, slowly move one foot sideways off the ball, then make it touch the floor, then come back to starting position. Alternate with the other foot.</p>\n<p>This is a core exercise.</p>","category":"Abs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409bcdf5fa1bf631cb9b"},"id":424,"name":"V-Bar Pulldown","description":"<p>Pulldowns using close grip v-bar.</p>","category":"Back","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a2c71904f529304db"},"id":308,"name":"Calf Press Using Leg Press Machine","description":"<p>Put  the balls of your feet on an extended leg press pad.  Use your calves to press the weight by flexing your feet/toes into a pointed position, and releasing back into a relaxed position.</p>\n<p>This exercise builds mass and strength in the Gastrocnemius and Soleus muscles as well, if not better, than any calf exercise.</p>","category":"Calves","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a295cf54535c4a655"},"id":1045,"name":"Bent Over Rowing Reverse","description":"","category":"Back","equipment":["Barbell"],"image":"https://wger.de/media/exercise-images/70/Reverse-grip-bent-over-rows-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409b793ce569af09c597"},"id":1057,"name":"Single Leg Extension","description":"","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a9468760491a57e3b"},"id":161,"name":"Rack Deadlift","description":"<p>Deadlift to be done using a Smith machine or a free rack. Bar or barbell hould be just right under the knee cap level. Lift using the glutes and through the heels, then come back to starting postion with a control movement of 2 seconds.</p>\n<p>This exercise targets mainly the lower back and glutes.</p>","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/161/Dead-lifts-1.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6cd"},"id":203,"name":"Wall Pushup","description":"<p>Pushup against a wall</p>","category":"Arms","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51ec"},"id":340,"name":"Incline Dumbbell Row","description":"<ol>\n<li>Using a neutral grip, lean into an incline bench.</li>\n<li>Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.</li>\n<li>Retract the shoulder blades and flex the elbows to row the dumbbells to your side.</li>\n<li>Pause at the top of the motion, and then return to the starting position.</li>\n</ol>","category":"Back","equipment":["Dumbbell","Incline bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b793ce569af09c599"},"id":207,"name":"Cable Cross-over","description":"<p>Begin with cables at about shoulder height, one in each hand. Take a step forward so that one foot is in front of the other, for stability, and so that there is tension on the cables. Bring hands together in front of you. Try to make your hands overlap (so that the cables cross) a few inches.</p>","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/71/Cable-crossover-1.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51ee"},"id":2035,"name":"Dumbbell Bent Over Row","description":"&nbsp;Hold&nbsp;your dumbbells&nbsp;at your sides and hinge at the hips until your chest is parallel to the floor, dumbbells hanging below your knees (picture 1). Keeping your elbows close to your body, row both dumbbells towards your hips (oicture 2). Squeeze your shoulder blades down and together and lower under control to the start before repeating. Avoid using momentum from your torso and focus on squeezing your back, hard.","category":"Shoulders","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/1085/2f9a9f90-ea2e-4f3f-b8ca-19aea162fe2d.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409b604e3a332a4bbcb2"},"id":2149,"name":"Russian Twist","description":"<ol><li>&nbsp;Hold a dumbbell, barbell weight or something else that is heavy with both hands, but make sure it is not too heavy and you are able to keep in form.</li><li>Lean back to a 45-degree angle from the floor. For an extra challenge, lift your feet off the floor.</li><li>Rotate your arms to one side to the same level as your chest, touch the floor for a little extra challenge, and then do the same to the other side. When you're back in your original position after doing both sides it will count as 1 rep.</li></ol>","category":"Abs","equipment":["Dumbbell","Gym mat","Swiss Ball"],"image":"https://wger.de/media/exercise-images/1193/70ca5d80-3847-4a8c-8882-c6e9e485e29e.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409a295cf54535c4a657"},"id":360,"name":"Ring Dips","description":"<p>Dips peformed on gymnastic rings.</p>","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a604e3a332a4bbcac"},"id":2209,"name":"TRX roll out","description":"sostener las empuñaduras con las manos, alargar los brazos y mantenerlos paralelos a la altura del pecho. El movimiento que debes realizar es una abertura de los brazos alineados con los hombros mientas inclinas el cuerpo hacia delante. Intenta no realizar una extensión de hombro más allá de los 90º y mantén contraída la musculatura abdominal y los glúteos.\nMúsculos implicados: Transverso, recto abdominal y erectores espinales","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b0e6a7c78b1d55a80"},"id":2207,"name":"Front Lever","description":"The front lever is a figure where the body is kept in a horizontal position parallel to the floor.","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b7f2f6172dc3459a4"},"id":1529,"name":"High knees","description":"<p>Starting positionStand straight.</p><p>Steps:</p><ol><li>Run in place, putting knees as high up as is comfortable and switching legs at a quick pace.</li></ol>","category":"Cardio","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51e4"},"id":2220,"name":"Back bridge","description":"Túmbate en el suelo apoyando la espalda en el suelo y las piernas flexionadas con los pies apoyados en el suelo, dejando unos 20 cm de distancia entre los pies y el culo. Las manos permanecen apoyadas en el suelo, pegadas a las orejas, con los dedos apuntando los pies. Los codos flexionados, y apuntando al techo. Esta es la posición inicial. Ahora empuja las caderas tan alto como puedas, elevando el cuerpo del suelo, y prosigue empujando a través de las manos, extendiendo los codos y las rodillas, hasta que la espalda esté bien arqueada (puente lumbar). La cabeza también despega del suelo, y debe quedar a la altura de los codos, mirando hacia atrás. Esta es la posición final. El descenso debe ser lento y controlado.\nLa columna debe estar en curvatura convexa. No valen despegar la espalda del suelo, y que ésta quede recta. Debe de estar bien redondeada. Se nota además una sensación de oxigenación mayor en la espalda.\nLas caderas, tras despegarse del suelo, deben de estar bien altas, incluso por encima del nivel de la cabeza.\nLos brazos y las piernas deben permanecer rectos. Parece fácil, pero requiere de un buen nivel de flexibilidad.\nLa respiración debe ser profunda. Esta postura estira la caja torácica, y pone el diafragma bajo presión. Si la postura está bien realizada, la respiración será perfecta. Nunca hay que mantener la respiración durante el ejercicio.","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b793ce569af09c593"},"id":106,"name":"Rowing, T-bar","description":"<p>The execution of this exercise is very similar to the regular bent over rowing, only that the bar is fixed here.</p>\n<p>Grab the barbell with a wide grip (slightly more than shoulder wide) and lean forward. Your upper body is not quite parallel to the floor, but forms a slight angle. The chest's out during the whole exercise. Pull now the barbell with a fast movement towards your belly button, not further up. Go slowly down to the initial position. Don't swing with your body and keep your arms next to your body.</p>","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/106/T-bar-row-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409b70617ad4aca4f101"},"id":2146,"name":"Curl de biceps con agarre prono","description":"<p style=\"\">POSICIÓN INICIAL:</p><p style=\"\">Seleccione el peso adecuado en una barra. Colóquese de pie con la barra usando un agarre prono y las manos a la anchura de los hombros. Contraiga el suelo pelvico y el core mientras mantiene su pecho levantado.</p><p style=\"\">EJECUCIÓN:</p><p style=\"\">Contrayendo los bíceps, doble los codos totalmente mientras exhala. Vuelva a la posición inicial con un suave movimiento mientras inhala.</p>","category":"Arms","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/1190/c05818bf-1c81-46df-9f24-42e354265388.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409b70617ad4aca4f0ff"},"id":1779,"name":"High plank","description":"<p>Starting position:</p><p>Get into the high plank position:your hands and toes should be touching the ground, your back, arms and legs should be straight.To get to this position, you can lie down on your stomach, place your hands facing down next to your head, and lifting your arms up until they are straight.</p><p>Steps:</p><ol><li>Maintain the starting position for the entire duration of the exercise.</li></ol>","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b793ce569af09c595"},"id":150,"name":"Shrugs, Barbells","description":"<p>Take a barbell and stand with a straight body, the arms are hanging freely in front of you. Lift from this position the shoulders as high as you can, but don't bend the arms during the movement. On the highest point, make a short pause of 1 or 2 seconds before returning slowly to the initial position.</p>\n<p>When training with a higher weight, make sure that you still do the whole movement!</p>","category":"Shoulders","equipment":["Barbell"],"image":"https://wger.de/media/exercise-images/150/Barbell-shrugs-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51f2"},"id":2238,"name":"Low Pulley Cable fFly","description":"<ol><li><b>Adjust the cable machine: </b>Set the pulley to the lowest setting possible.</li><li><b>Choose your handles: </b>You can use neutral grip handles (palms facing each other) or straight handles depending on your preference. Neutral grip might be easier on your wrists.</li><li><b>Stand with proper form: </b>Stand with your feet shoulder-width apart, knees slightly bent, and core engaged. Maintain a slight arch in your lower back throughout the exercise.</li><li><b>Grip the handles: </b>Grab the handles with your chosen grip and step back a small step or two until there's slight tension on the cables.</li><li><b>Initiate the movement: </b>Keep your elbows slightly bent throughout the exercise. Imagine you're giving someone a big hug. Squeeze your chest muscles as you bring your hands together in front of your chest.</li><li><b>Control the movement: </b>Focus on squeezing your chest muscles rather than using your arms to pull the handles.</li><li><b>Peak contraction: </b>Briefly hold the squeeze at the top of the movement with your hands together at chest level.</li><li><b>Return slowly: </b>Slowly release the tension and return the handles back down to the starting position with your arms slightly extended but not locked out.</li></ol>","category":"Chest","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409afaaf71d471ce3f4a"},"id":2103,"name":"Aperturas en polea","description":"Este ejercicio trabaja y tensa todo el músculo del pecho. Este entrenamiento de pecho es bueno, pero el equipo generalmente solo se encuentra en gimnasios públicos.","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/1129/4e92e0ae-f71f-4c71-8408-17f32dad81fb.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409aefe109f5a0ec51e0"},"id":2188,"name":"Claps over the head","description":"Stand with your feet shoulder width apart. Raise your arms and clap over your head","category":"Arms","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/1223/bf20836a-23b0-4f50-8b98-cfdd97684527.webp","diary":[],"__v":0}
{"_id":{"$oid":"6663409b2c71904f529304e5"},"id":2257,"name":"Reverse Grip Barbell Curls","description":"Hold the barbell with an overhand grip (palms facing down) approximately shoulder-width apart. Ensure your back is straight, shoulders slightly pulled back, and arms fully extended.\nCurl the barbell upwards towards your chest in a controlled motion, keeping your elbows close to your body. The motion should be smooth without any swinging or momentum use.\nOnce the barbell is at chest level, pause briefly to maximize contraction in the biceps and forearms.\nSlowly lower the barbell back to the starting position with a controlled movement, fully extending your arms.","category":"Arms","equipment":["Barbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409a1c26c2538127b6d5"},"id":2255,"name":"Planche de cote dynamique","description":"La planche latérale dynamique implique de se placer sur le côté, en appui sur un coude et le côté du pied, puis de basculer les hanches de haut en bas tout en maintenant une ligne droite du corps.","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b9468760491a57e41"},"id":670,"name":"Renegade Row","description":"<p>Get into pushup position gripping some dumbbells. Perform one pushup, then drive your left elbo up, bringing the dumbell up to your body. Return the dumbell to starting position. </p>\n<p>Perform another pushup and then row with the other arm to complete one rep.</p>","category":"Back","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409d0a957e33336ef420"},"id":807,"name":"Handstand Pushup","description":"The handstand push-up (press-up) - also called the vertical push-up (press-up) or the inverted push-up (press-up) also called commandos- is a type of push-up exercise where the body is positioned in a handstand. For a true handstand, the exercise is performed free-standing, held in the air. To prepare the strength until one has built adequate balance, the feet are often placed against a wall, held by a partner, or secured in some other way from falling. Handstand pushups require significant strength, as well as balance and control if performed free-standing.","category":"Shoulders","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409b295cf54535c4a661"},"id":416,"name":"Crunches With Legs Up","description":"<p>On your back, legs extended straight up, reach toward your toes with your hands and lift your shoulder blades off the ground and back.</p>","category":"Abs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51f0"},"id":317,"name":"Hand Grip","description":"<p>chrome Hand Flex Grip to build up forearms muscles</p>","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409befe109f5a0ec51f4"},"id":128,"name":"Hyperextensions","description":"<p>Sdraiarsi sul cuscino per iperestensione con l'ombelico in corrispondenza del bordo anteriore, mentre la parte superiore del corpo può pendere liberamente. Tendete tutti i muscoli della schiena e portate il busto in alto fino a raggiungere l'orizzontale, ma non oltre. Scendere lentamente e non rilassare i muscoli.</p>","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/128/Hyperextensions-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409eaad34fcfe8679d7b"},"id":1884,"name":"Back neck stretch","description":"<p>Starting position:</p><p>Sit upright on a chair or a firm pillow.</p><p>Steps:</p><ol><li>Breathe out and tilt your head forward, chin to chest, putting hands behind your head.</li><li>Use your hands to pull your head down lightly and press against your hands with your head to balance out the force.</li><li>Hold for a bit.</li><li>Relax your arms and head, opening up a bit with your shoulders.</li><li>Keep repeating this from step 2 onward.</li></ol>","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e915afc7fb6f47367"},"id":98,"name":"Butterfly","description":"<p>Sit on the butterfly machine, the feet have a good contact with the floor, the upper arms are parallel to the floor. Press your arms together till the handles are practically together (but aren't!). Go slowly back. The weights should stay all the time in the air.</p>","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/98/Butterfly-machine-1.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409ed471e81143f3602f"},"id":138,"name":"Hammercurls on Cable","description":"<p>Take a cable in your hands (palms parallel, point to each other), the body is straight. Bend the arms and bring the weight up with a fast movement. Without any pause bring it back down with a slow, controlled movement, but don't stretch completely your arms.</p>\n<p>Don't swing your body during the exercise, the biceps should do all the work here. The elbows are at your side and don't move.</p>","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/138/Hammer-curls-with-rope-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409eab950a73cf06d599"},"id":2200,"name":"Frog stand","description":"Starting position:\n\nStand with your feet shoulder-width apart and your toes pointing forward, facing a wall or bench for support if needed.\nBend your knees into a squat position.\nPlace your hands on the ground in front of you, shoulder-width apart, with your fingers spread wide.\nMake sure your elbows are under your shoulders and your body forms a straight line from your head to your heels.\nUpward phase:\n\nPush with your feet and hands to lift your body off the ground.\nStraighten your legs and arms, keeping your body aligned.\nEngage your core and glutes to maintain the position.\nIf needed, rest your knees on the wall or bench for assistance.","category":"Abs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e7faf5584525b9ede"},"id":2260,"name":"Arco femorale una gamba","description":"Nello specifico i muscoli coinvolti sono: bicipite femorale. muscolo semimembranoso. muscolo semitendinoso.","category":"Back","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409d3b83fc6c66d0e4c9"},"id":810,"name":"Jumping Jacks","description":"<p>A jumping jack or star jump, also called side-straddle hop in the US military, is a physical jumping exercise performed by jumping to a position with the legs spread wide and the hands going overhead, sometimes in a clap, and then returning to a position with the feet together and the arms at the sides</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e614edd7bb39cda13"},"id":2037,"name":"Dumbbell Hang Power Cleans","description":"On your feet, stand tall with your dumbbells, holding them at your sides. Hinge at the hips to lower them to your knees (picture 1). Stand back up with a slight jump, using the momentum to pull the dumbbells up on to your shoulders (picture 2). Stand up straight, then lower under control to your sides and repeat. Keep this fast and explosive; if your heart rate doesn’t hit the roof, you’re doing them wrong.","category":"Back","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/1087/d85f4e02-b20c-457c-bdfb-0b00e2d14150.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409dbfef239df546f109"},"id":149,"name":"Lateral Rows on Cable, One Armed","description":"<p>Set cable at waist height, start with arm across your belly and move han over and out too other side, one arm at the time.</p>","category":"Shoulders","equipment":[],"image":"https://wger.de/media/exercise-images/349/d74d171e-d39a-4c13-bbcd-6821bc94d424.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409ee973c5aa75973157"},"id":399,"name":"Reverse Grip Bench Press","description":"<p>Upper chest focuses exercise that also works triceps</p>","category":"Chest","equipment":["Barbell","Bench"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409df9c9797d74baf3b5"},"id":2107,"name":"Biceps concentrado martillo (maquina)","description":"Ejecución\n1. Realice la posición inicial.\n2. Mantenga el agarre firme en todo momento, suba hasta la altura de los hombros, y hasta que ambos brazos queden flexionados. Exhale y contraiga los bíceps.\n3. Luego baje lentamente, buscando que sus brazos se encuentren totalmente extendidos. En este punto inhale.\n4. Repita las veces que desee.","category":"Arms","equipment":[],"image":"https://wger.de/media/exercise-images/1130/4003d1b6-0b1a-463e-9778-0ae3ddeaf0d9.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409e4c0c26dbce80b5ad"},"id":193,"name":"Preacher Curls","description":"<p> Place the EZ curl bar on the rest handles in front of the preacher bench. Lean over the bench and grab the EZ curl bar with palms up. Sit down on the preacher bench seat so your upper arms rest on top of the pad and your chest is pressed against the pad. Lower the weight until your elbows are extended and arms are straight. Bring the weights back up to the starting point by contracting biceps. Repeat</p>","category":"Arms","equipment":["SZ-Bar"],"image":"https://wger.de/media/exercise-images/193/Preacher-curl-3-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409e067c6d96f2b52f38"},"id":2216,"name":"TRX gorilla biceps curl","description":"Nos colocaremos de frente a las cintas del TRX y las agarraremos con los puños de las manos enfrentados y al frente, con los brazos totalmente estirados a la altura más o menos de los hombros. El cuerpo lo mantendremos recto hacia atrás, como en los anteriores ejercicios, ya que lo que vamos a hacer es mediante la activación de los bíceps, elevar el cuerpo hacia las cintas del TRX.El cuerpo estará recto y los pies apoyados en el suelo. Los brazos en esta ocasión, los vamos a colocar abiertos hacia los lados, y a la altura del pecho. El movimiento que vamos a hacer será una contracción hacia el pecho. Para conseguirlo, lo que haremos será doblar los codos para que, mediante la activación de los bíceps atraigamos el cuerpo hacia las cintas.","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e600b25f7cdffd03d"},"id":160,"name":"Pistol Squat","description":"<ol><li>Stand with feet hip-width apart, toes pointed forward, and chest tall.</li><li>Extend your leg straight out; extend both arms in front of you, at shoulder level. Brace your core and look straight ahead.</li><li>Slowly squat down.&nbsp;</li><li>(optional) pause at the bottom.&nbsp;</li></ol>\nKeep your (free) leg and arms extended for the whole duration.","category":"Legs","equipment":[],"image":"https://wger.de/media/exercise-images/456/b8f007b1-d43f-416d-a44b-fb3c15291414.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409fee97e3630d6a5942"},"id":389,"name":"Low Box Squat - Wide Stance","description":"<p>Unrack the bar and set your stance wide, beyond your hips.  Push your hips back and sit down to a box that takes you below parallel.  Sit completely down, do not touch and go.  Then explosively stand up.  Stay tight in your upper back and torso throughout the movement.</p>","category":"Legs","equipment":["Barbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409f5ad002fcccef621b"},"id":398,"name":"Run - Interval Training","description":"<p>Run and do some interval trainings such as hill repat, fartlek,..</p>","category":"Cardio","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e11ea3f0a0fe1dad4"},"id":238,"name":"Plank","description":"<p>Get into a position on the floor supporting your weight on your forearms and toes. Arms are bent and directly below the shoulder.&nbsp;</p>\n<p>Keep your body straight at all times and hold this position as long as possible. To increase difficulty an arm or leg can be raised while performing this exercise.</p>","category":"Abs","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/458/122735cf-f940-4de8-aa30-49a1da148319.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409fc6f007d9ff53b723"},"id":2186,"name":"Australian pull-ups","description":"<ol><li>Lie down under a high bar or suspension bar, positioned at an appropriate height.</li><li>Position yourself on your back under the bar, gripping the bar with a supinated grip (palms facing you).</li><li>Adjust your position so that your body is aligned straight from head to toe. Arms should be fully extended, shoulders stabilized, and legs aligned with the rest of the body.</li><li>Bend your elbows and pull your chest towards the bar, contracting your back muscles. Imagine you're trying to bring your shoulder blades together.</li><li>Hold the contraction at the top of the movement for a moment to maximize muscle activation.</li><li>Slowly return to the starting position, extending your elbows.</li></ol>","category":"Arms","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e8c9d77bd17550b0f"},"id":2044,"name":"Plank Shoulter Taps","description":"In the correct plank position, place your feet slightly wider than shoulder-width apart. alternately lift and touch the opposite shoulder with one hand.","category":"Abs","equipment":["Gym mat"],"image":"https://wger.de/media/exercise-images/1091/50c8912d-54ef-46c9-99d1-633b6196aa1e.jpg","diary":[],"__v":0}
{"_id":{"$oid":"6663409ef3d35789c264d924"},"id":2067,"name":"Walking","description":"Walking outdoor or indoor, try keeping a pace of at list 100 steps per minute.","category":"Cardio","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e661cd43a6e3533be"},"id":2266,"name":"Helms Row","description":"Setup: Place your chest on the end of a bench, using a towel or anything soft to keep your chest protected. You want your chest to be in contact with the bench around the nipple line. Your back should be almost parallel to the floor\n\nExecution: When you’re starting the exercise, focus on pulling your elbows back until you feel maximum tightness in the lats.\n\nIf you want to get some trap activation with the exercise, relax your shoulder blades when the weights are hanging down and then retract them as you start the rep.","category":"Back","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e7dd58785e55f5eeb"},"id":2150,"name":"PALLOF PRESS","description":"The Pallof press is an anti-rotation exercise that trains the larger and smaller muscles around the spine to resist rotation.<ul><li>Stand parallel to the cable machine or to the anchor point to the \nresistance band and clasp with the handle or band with both hands.</li><li>Make sure your torso is front on and bring your hands to the center of your chest and slowly press out.</li><li>Slowly return your hands to the chest and repeat.</li></ul>","category":"Abs","equipment":[],"image":"https://wger.de/media/exercise-images/1194/074e1766-4208-4a67-a211-9721772d99b0.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409e3315c658f0d95335"},"id":2205,"name":"Double Leg Calf Raise","description":"The double leg heel raise is important to strengthen and create control and stability around the ankle and knee, and provide balance and control for the hip and pelvis.","category":"Legs","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/1243/53d4fabe-c994-4907-873f-8d82813a9832.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409e37a8a02696d336fb"},"id":194,"name":"Cross-Bench Dumbbell Pullovers","description":"<p>Grasp a moderately weighted dumbbell so your palms are flat against the underside of the top plates and your thumbs are around the bar. Lie on your back across a flat bench so only your upper back and shoulders are in contact with the bench. Your feet should be set about shoulder-width apart and your head should hang slightly downward. With the dumbbell supported at arm's length directly about your chest, bend your arms about 15 degrees and keep them bent throughout the movement. Slowly lower the dumbbell backward and downward in a semicircle arc to as low a position as is comfortably possible. Raise it slowly back along the same arc to the starting point, and repeat for the required number of repetitions.</p>","category":"Chest","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409e42096cb9d697ac2e"},"id":2039,"name":"Medicine ball twist","description":"In a seated position, the torso is rotated from side to side without forcing, approaching the knees and making the ball touch the ground from time to time","category":"Abs","equipment":["Swiss Ball"],"image":"https://wger.de/media/exercise-images/1089/49f51716-535d-41dd-aeb5-cff5bb906bc1.jpeg","diary":[],"__v":0}
{"_id":{"$oid":"6663409ef52bf184527eb07e"},"id":2265,"name":"JM Press","description":"The JM press keeps your shoulders stationary, relying on the elbow flexion and extension to move the weight using your triceps strength. That means you get all the benefits of the best triceps-strengthening exercises without overtaxing that delicate shoulder joint. Classic win-win!","category":"Arms","equipment":["Barbell"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409efa7715b82f497704"},"id":93,"name":"Negative Crunches","description":"<p>Sit yourself on the decline bench and fix your legs. Cross your arms over the chest and bring with a rolling movement your upper body up, go now without a pause and with a slow movement down again. Don't let your head move during the exercise.</p>","category":"Abs","equipment":[],"image":"https://wger.de/media/exercise-images/93/Decline-crunch-2.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409e2db2003371823a8f"},"id":2115,"name":"JALON EN BANCO INCLINADO","description":"Sobre el banco inclinado frete a la maquina de polea, con el cuerpo boca bajo sobre el banco, se realiza el jalón.","category":"Back","equipment":[],"image":"https://wger.de/media/exercise-images/1138/6c35fd79-ef35-4cf3-abf5-9c969457b8d4.PNG","diary":[],"__v":0}
{"_id":{"$oid":"666340a160fed1ef2d25e9cb"},"id":1236,"name":"Quadriped Arm and Leg Raise","description":"In this exercise, the back muscles and the muscles of the back of the leg and back of the arm are activated by lifting the crossed arm and leg at the same time in the crawling position. It also improves balance and proprioception. The movement is done symmetrically.\n\n1. Get into a crawling posture.2. Draw your abdomen in, then raise your right leg and left arm.3. You should keep your abdomen in for 8 seconds.4. After 8 seconds, slowly lower your arm and leg.5. Then release your muscle.\n","category":"Back","equipment":["none (bodyweight exercise)"],"image":"https://wger.de/media/exercise-images/957/0fd94587-6021-4763-856e-7227f5fcba2a.png","diary":[],"__v":0}
{"_id":{"$oid":"666340a14e4f764d1fb00651"},"id":1163,"name":"Handstand Push Up","description":"Handstands Push Up which demand high level of skill","category":"Shoulders","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1a0279e2bdcfaf91e"},"id":1715,"name":"Mountain climbers","description":"<p>Starting position:</p><p>Start in the upright push-up position, aka. the high plank position.Hands should be directly under your shoulders.Keep your head in line with your back, facing the floor.Feet should be about hip-width apart.</p><p>Steps:</p><ol><li>Move one knee toward the center of your body, towards your elbows, keeping the other leg extended.</li><li>In a quick jumping movement, straighten the bent leg out and pull the other knee toward your body.</li><li>Keep repeating step 2, alternating legs.</li></ol><p>Notes:</p><p>Throughout the exercise, your back should remain as straight as possible – avoid a hump or a sagging back.</p>","category":"Chest","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1c1e2cad10f949919"},"id":2170,"name":"Prisoner Squat","description":"Stand upright with your chest slightly raised, your feet hip-width apart and your toes pointing straight ahead.\n\nBring your hands to the back of your head with your fingers slightly interlaced and your elbows pointing to the side. Push your hips back and bend your knees, keeping your upper body as upright as possible.&nbsp;\n\nPush your knees outwards, they must never point towards each other. If your upper body moves slightly forward, make sure that it does not bend. Always keep your elbows level with your ears by tensing the muscles between your shoulder blades. If you are flexible enough, you can sink down until your buttocks touch your calves.\nHowever, make sure that you do not bend your spine.&nbsp;\n\nBefore this happens, reverse the movement and use your heels and glutes to push yourself upwards with so much momentum that your feet lift off briefly and you do a little hop.&nbsp;\n\nIf necessary, correct the position of your feet, arms and upper body before you move on to the next repetition.\n\nTranslated with www.DeepL.com/Translator (free version)","category":"Legs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"6663409fb7f5660d917a3e1e"},"id":321,"name":"Weighted Step-ups","description":"<p>box step ups w/ barbell and 45's on each side</p>","category":"Legs","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1a6fb9b75be95c726"},"id":115,"name":"Leg Presses (narrow)","description":"<p>The exercise is very similar to the wide leg press:</p>\n<p>Sit on the machine and put your feet on the platform so far apart  that you could just put another foot in between them. The feet are parallel and point up.</p>\n<p>Lower the weight so much, that the knees form a right angle. Push immediately the platform up again, without any pause. When in the lower position, the knees point a bit outwards and the movement should be always fluid.</p>","category":"Legs","equipment":[],"image":"https://wger.de/media/exercise-images/373/60e2aa21-1910-40d3-9fed-babfee06dd48.png","diary":[],"__v":0}
{"_id":{"$oid":"6663409fc7e01181a4b7d2a8"},"id":2056,"name":"Abduktion im Stand","description":"Das Training des stabilen Standes dominat auf einem Bein ist beiseitig entscheidend. Einerseits um Beschwerden vorzubeugen und andererseits um eine stabile Basis zu legen.Die übende Person stellt sich in die gewohnte Standposition und versucht bei stabilem Oberkörper das unbelastete Bein wiederholt zu heben und und in Hüfte und Knie zu beugen und wieder zu senken. Die Bewegung wird jedenfalls auch mit der anderen Seite wiederholt.\nDie Übung trainiert die Stabilität der hüftumgebenden Muskulatur","category":"Legs","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1c80c8e392548c3f6"},"id":111,"name":"Squats","description":"<p>Place a barbell in a rack just below shoulder-height. Dip under the bar to put it behind the neck across the top of the back, and grip the bar with the hands wider than shoulder-width apart. Lift the chest up and squeeze the shoulder blades together to keep the straight back throughout the entire movement. Stand up to bring the bar off the rack and step backwards, then place the feet so that they are a little wider than shoulder-width apart. Sit back into hips and keep the back straight and the chest up, squatting down so the hips are below the knees. From the bottom of the squat, press feet into the ground and push hips forward to return to the top of the standing position.</p>","category":"Legs","equipment":["Barbell"],"image":"https://wger.de/media/exercise-images/111/Wide-stance-squat-1.gif","diary":[],"__v":0}
{"_id":{"$oid":"666340a226eb1aa0025e2493"},"id":148,"name":"Lateral Raises","description":"This exercise works the deltoid muscle of the shoulder. The movement starts with the arms straight, and the hands holding weights at the sides or in front of the body. Body is in a slight forward-leaning position with hips and knees bent a little. Arms are kept straight or slightly bent, and raised through an arc of movement in the coronal plane that terminates when the hands are at approximately shoulder height. Weights are lowered to the starting position, completing one rep. When using a cable machine the individual stands with the coronal plane in line with the pulley, which is at or near the ground.[9] The exercise can be completed one shoulder at a time (with the other hand used to stabilize the body against the weight moved), or with both hands simultaneously if two parallel pulleys are available.","category":"Shoulders","equipment":["Dumbbell"],"image":"https://wger.de/media/exercise-images/148/lateral-dumbbell-raises-large-1.png","diary":[],"__v":0}
{"_id":{"$oid":"666340a2174b695e96f699eb"},"id":1702,"name":"Backward arm circles","description":"<p>Starting position:</p><p>Stand tall with your back straight.</p><p>Steps:</p><ol><li>Keeping your arms straight, bring them in front of you, raise them over your head, then continue the motion behind your back and down to the initial position.</li><li>Keep circling your arms as described in step 1.</li></ol>","category":"Arms","equipment":["none (bodyweight exercise)"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a24b61e76122147ea6"},"id":1192,"name":"Reverse Preacher Curl (Close Grip)","description":"Sitting reverse on a Biceps Bench with a close grip","category":"Arms","equipment":["SZ-Bar"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1812c51558e7b1710"},"id":209,"name":"Stiff-legged Deadlifts","description":"<ul>\n<li>Keep legs straight</li>\n<li>Keep back straight</li>\n</ul>","category":"Legs","equipment":["Barbell"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a10278046457b8775f"},"id":1064,"name":"Chest Press","description":"","category":"Chest","equipment":[],"image":"https://wger.de/media/exercise-images/129/6f9bb7ce-cb3a-4b5c-9ddb-aa5e47a5704a.png","diary":[],"__v":0}
{"_id":{"$oid":"666340a1128f459e9c7c3bcf"},"id":2214,"name":"TRX hammer curl - biceps","description":"Colocar los agarres como si de una continuación de las cintas se tratase. Colocaremos los brazos estirados hacia adelante y el cuerpo hacia atrás totalmente recto. Los músculos de los bíceps se activarán al doblar los codos para atraer el cuerpo hacia las cintas. El movimiento de contracción terminará con un ligero movimiento de las manos hacia afuera, debido al agarre que estamos teniendo.","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"666340a292e62b962332c735"},"id":205,"name":"Single-arm Preacher Curl","description":"<p>Sit on the preacher curl bench and perform a bicep curl with a dumbbell in one hand. Your other hand can be at rest, or beneath your curling arm's elbow.</p>","category":"Arms","equipment":["Dumbbell"],"diary":[],"__v":0}
{"_id":{"$oid":"666340a1204ca0c94864f878"},"id":1052,"name":"Crunches on incline bench","description":"<p>Lay down on your back on a inclined bench, feet are on one end of the bench. Ask a partner or use some other help (barbell, etc.) to keep them fixed, your hands are behind your head. From this position move your upper body up till your head or elbows touch your knees. Do this movement by rolling up your back.</p>","category":"Abs","equipment":["Incline bench"],"image":"https://wger.de/media/exercise-images/56/Decline-crunch-2.png","diary":[],"__v":0}
{"_id":{"$oid":"666340a15a5bcc737a7389ac"},"id":291,"name":"Hercules Pillars","description":"<p>Grab two cables stand in the middle so both have tension and hold</p>","category":"Arms","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"666340a20760b63c8bef6545"},"id":211,"name":"Leverage Machine Chest Press","description":"<p>Be sure to adjust seat height so that the handles are towards the bottom of your pectorals.</p>","category":"Chest","equipment":[],"diary":[],"__v":0}
{"_id":{"$oid":"66883caf775f1d8c66551873"},"id":2267,"name":"Machine Crunches","category":"Abs","equipment":[],"diary":[],"image":"https://kinxlearning.com/cdn/shop/files/exercise-19_1000x.jpg?v=1613154703"}
